In [1]:
-- What is the oldest business on each continent?

WITH all_business AS(
	SELECT business, year_founded, country_code
	FROM businesses	b
	UNION ALL 
	SELECT business, year_founded, country_code	
	FROM new_businesses nb
),
oldest_business_continent AS (
	SELECT 
	ab.business, 
    ab.year_founded, 
    ab.country_code,
	c.country,
	c.continent
	FROM all_business AS ab
	RIGHT JOIN countries AS c
	ON ab.country_code = c.country_code
),
min_year AS (
	SELECT obc.continent, MIN(year_founded) AS year_founded
	FROM oldest_business_continent obc
	GROUP BY continent
)	
SELECT 
	obc.continent AS continent,
	obc.country AS country,
	obc.business AS business,
	obc.year_founded AS year_founded
FROM oldest_business_continent obc
JOIN min_year m
ON obc.continent = m.continent AND obc.year_founded = m.year_founded;

SyntaxError: invalid syntax (943882801.py, line 3)

In [ ]:

-- How many countries per continent lack data on the oldest businesses?

WITH all_business AS (
    SELECT business, year_founded, country_code
    FROM businesses
),
location AS (
    SELECT c.country_code, c.continent
    FROM countries c
    LEFT JOIN all_business ab ON c.country_code = ab.country_code
    WHERE ab.year_founded IS NULL
)
SELECT continent, COUNT(DISTINCT country_code) AS countries_without_businesses
FROM location
GROUP BY continent;

-- Does including the `new_businesses` data change this?

WITH all_business AS (
    SELECT business, year_founded, country_code
    FROM businesses
    UNION ALL
    SELECT business, year_founded, country_code
    FROM new_businesses
),
location AS (
    SELECT c.country_code, c.continent
    FROM countries c
    LEFT JOIN all_business ab ON c.country_code = ab.country_code
    WHERE ab.year_founded IS NULL
)
SELECT continent, COUNT(DISTINCT country_code) AS countries_without_businesses
FROM location
GROUP BY continent;

In [ ]:


WITH all_business AS (
	SELECT category_code, year_founded, country_code
	FROM businesses
	UNION ALL 
	SELECT category_code, year_founded, country_code	
	FROM new_businesses
),
location AS (
	SELECT DISTINCT continent, category_code, year_founded
	FROM countries c
	JOIN all_business ab
	ON ab.country_code = c.country_code
),
oldest_by_continent_category AS (
	SELECT continent, ct.category, MIN(year_founded) AS year_founded
	FROM location l
	JOIN categories ct 
	ON l.category_code = ct.category_code
	GROUP BY continent, ct.category
)
SELECT DISTINCT continent, category, year_founded
FROM oldest_by_continent_category obcc;